# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц (зима,
# весна, лето, осень). Напишите решения через list и через dict.

season_list = [
    ['Весна', ['3', '4', '5']],
    ['Лето', ['6', '7', '8']],
    ['Осень', ['9', '10', '11']],
    ['Зима', ['1', '2', '12']]
]

season_dict = {
    'Весна': ['3', '4', '5'],
    'Лето': ['6', '7', '8'],
    'Осень': ['9', '10', '11'],
    'Зима': ['1', '2', '12']
}

month = input('Введите номер месяца: ')
if month in sum(season_dict.values(), []):
    for key, val in season_list:
        if month in val:
            print(f'list: Месяц с номером {month} - {key}')

    for key, val in season_dict.items():
        if month in val:
            print(f'dict: Месяц с номером {month} - {key}')
else:
    print('Несуществующий номер месяца')
